[
  {
    "name": "Path-to-production mapping",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p>Path-to-production mapping involves a cross-functional workshop that visually maps the software release process to identify delays, risks, and improvement areas, often using value-stream mapping.</p>"
  },
  {
    "name": "Value-stream mapping",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p>Value-stream mapping is a lean-management method for analyzing the current state and designing a future state for the series of events that take a product or service from its beginning through to the customer. It helps identify waste and areas for improvement in the process.</p>"
  },
  {
    "name": "Dataform",
    "ring": "Assess",
    "quadrant": "Languages & Frameworks",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://cloud.google.com/dataform\">Dataform</a></strong> is a data preparation product that enables building complex and scalable data models in Google BigQuery. Offers easy documenting, templating, testing and versioning. I love JS templates and functional modelling approach.</p>"
  },
  {
    "name": "Team cognitive load",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p>Team interactions play a crucial role in organizational agility and software design (see <a href=\"https://en.wikipedia.org/wiki/Conway%27s_law\">Conway's Law</a>), impacting how autonomously teams deliver customer value, so it's essential to intentionally design team structures, track team cognitive load, and measure how easily teams build, test, and maintain their services. It can be assessed using the ideas from >a href=\"https://teamtopologies.com/\">Team Topologies</a> book.</p>"
  },
  {
    "name": "Google BigQuery",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "FALSE",
    "description": "<p>BigQuery is a powerful, fully-managed data warehouse that enables super-fast SQL queries using the processing power of Google's infrastructure. It is particularly highly popular for ad and marketing products due to its ability to handle large datasets and provide real-time analytics.</p>"
  },
  {
    "name": "Virtual Environments",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p>My everyday languages are Python and Node.js and managing multiple projects can be challenging, especially when they have varying requirements. Tools like <strong><a href=\"https://github.com/pyenv/pyenv\">PyENV</a></strong> and <strong><a href=\"https://github.com/nvm-sh/nvm\">NVM</a></strong> are essential for managing multiple versions of Python and Node.js, respectively. They allow you to switch between different versions easily, ensuring compatibility across projects.</p><p>For project-specific dependencies, Python's <strong><a href=\"https://docs.python.org/3/library/venv.html\">venv</a></strong> and Node.js's <strong><a href=\"https://docs.npmjs.com/cli/v7/configuring-npm/folders#node_modules\">node_modules</a></strong> are the go-to tools. Virtual environments (venv) create isolated environments for each Python project, allowing you to install dependencies without affecting other projects. Similarly, the node_modules directory in a Node.js project contains all the dependencies specific to that project.</p><p>When it comes to package management, Python's <strong><a href=\"https://pip.pypa.io/en/stable/\">pip</a></strong> and Node.js's <strong><a href=\"https://www.npmjs.com/\">npm</a></strong> are widely used. Pip is the package installer for Python, allowing you to install and manage Python packages. Npm (Node Package Manager) serves a similar purpose for Node.js, enabling you to install and manage packages for your Node.js projects.</p>"
  },
  {
    "name": "GitHub Workflows",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "FALSE",
    "description": "<p>GitHub Workflows is a powerful tool for automating your software development workflows. It allows you to define the actions to automate using YAML files, which can be triggered by various events such as push, pull request, issue creation, etc. You can use GitHub Workflows to automate your project management, build, test, and deployment processes, ensuring that your code is always in a deployable state. GitHub Actions Marketplace gives a rich choice of solutions for development operations.</p>"
  },

  {
    "name": "git",
    "ring": "Assess",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p>Git is a distributed version control system that is widely used in software development. It allows multiple developers to work on the same project simultaneously, tracking changes and merging them seamlessly. Git is essential for managing codebases, enabling collaboration, and ensuring that changes are tracked and easy to promote to production code or reverse. It is essential for software development.</p>"
  },
  {
    "name": "Coding Copilot",
    "ring": "Trial",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p>Coding copilot is a new category of development tools that use AI to assist developers in writing code. Tools like GitHub Copilot and Gemini Code Assist use machine learning models to predict code completions, suggest code snippets, and provide context-aware code suggestions. These tools can help developers write code faster, reduce errors, and improve productivity. Being a part of IDE offers benefits from the additional context of the codebase and the ability to learn from the developer's coding style.</p>"
  }
]
